OpenFOAM/foam9tutorials/interfluo/OpenFOAM-pimpleFOAM-Rectangular_Cylinder-main/OpenFOAM-pimpleFOAM-Rectangular_Cylinder-main/OpenFOAM/case2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
                             
                     
scale   1;

vertices
(
(0 0 -0.5) //0
(2 0 -0.5) //1
(3 0 -0.5) //2
(15 0 -0.5) //3
(15 2 -0.5) //4
(15 3 -0.5) //5
(15 5 -0.5) //6
(3 5 -0.5) //7
(2 5 -0.5) //8
(0 5 -0.5) //9
(0 3 -0.5) //10
(0 2 -0.5) //11
(2 2 -0.5) //12
(3 2 -0.5) //13
(3 3 -0.5) //14
(2 3 -0.5) //15

(0 0 0.5) //16
(2 0 0.5) //17
(3 0 0.5) //18
(15 0 0.5) //19
(15 2 0.5) //20
(15 3 0.5) //21
(15 5 0.5) //22
(3 5 0.5) //23
(2 5 0.5) //24
(0 5 0.5) //25
(0 3 0.5) //26
(0 2 0.5) //27
(2 2 0.5) //28
(3 2 0.5) //29
(3 3 0.5) //30
(2 3 0.5) //31
);

blocks
(
hex (0 1 12 11 16 17 28 27) (100 50 1) simpleGrading (1 1 1)
hex (11 12 15 10 27 28 31 26) (100 50 1) simpleGrading (1 1 1)
hex (10 15 8 9 26 31 24 25) (100 50 1) simpleGrading (1 1 1)
hex (15 14 7 8 31 30 23 24) (100 50 1) simpleGrading (1 1 1)
hex (1 2 13 12 17 18 29 28) (100 50 1) simpleGrading (1 1 1)
hex (14 5 6 7 30 21 22 23) (200 50 1) simpleGrading (4 1 1)
hex (13 4 5 14 29 20 21 30) (200 50 1) simpleGrading (4 1 1)
hex (2 3 4 13 18 19 20 29) (200 50 1) simpleGrading (4 1 1)
);

edges
(
);

boundary
(
outlet
{
type patch;
faces
(
(3 4 20 19)
(4 5 21 20)
(5 6 22 21)
);
}

inlet
{
type patch;
faces
(
(11 0 16 27)
(10 11 27 26)
(9 10 26 25)
);
}

wall1
{
type wall;
faces
(
(6 7 23 22)
(7 8 24 23)
(8 9 25 24)
);
}

wall2
{
type wall;
faces
(
(0 1 17 16)
(1 2 18 17)
(2 3 19 18)

);
}

cylinder
{
type wall;
faces
(
(15 12 28 31)
(14 15 31 30)
(12 13 29 28)
(13 14 30 29)
);
}


);

mergePatchPairs
(
);

// ************************************************************************* //
